###################################################################

# Created by write_sdc on Tue Dec 17 18:51:51 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 99999
set_driving_cell -lib_cell BUFX2 [get_ports clk]
set_driving_cell -lib_cell BUFX2 [get_ports rst]
set_driving_cell -lib_cell BUFX2 [get_ports fsm_out_select_in]
set_driving_cell -lib_cell BUFX2 [get_ports {left_in[3]}]
set_driving_cell -lib_cell BUFX2 [get_ports {left_in[2]}]
set_driving_cell -lib_cell BUFX2 [get_ports {left_in[1]}]
set_driving_cell -lib_cell BUFX2 [get_ports {left_in[0]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[23]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[22]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[21]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[20]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[19]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[18]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[17]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[16]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[15]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[14]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[13]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[12]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[11]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[10]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[9]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[8]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[7]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[6]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[5]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[4]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[3]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[2]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[1]}]
set_driving_cell -lib_cell BUFX2 [get_ports {top_in[0]}]
set_ideal_network [get_ports rst]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.1  [get_ports fsm_out_select_in]
set_input_delay -clock clk  0.1  [get_ports {left_in[3]}]
set_input_delay -clock clk  0.1  [get_ports {left_in[2]}]
set_input_delay -clock clk  0.1  [get_ports {left_in[1]}]
set_input_delay -clock clk  0.1  [get_ports {left_in[0]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[23]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[22]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[21]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[20]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[19]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[18]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[17]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[16]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[15]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[14]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[13]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[12]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[11]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[10]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[9]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[8]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[7]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[6]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[5]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[4]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[3]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[2]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[1]}]
set_input_delay -clock clk  0.1  [get_ports {top_in[0]}]
set_output_delay -clock clk  0.1  [get_ports {right_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {right_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {right_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {right_out[0]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[23]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[22]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[21]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[20]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[19]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[18]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[17]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[16]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[15]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[14]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[13]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[12]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[11]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[10]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[9]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[8]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[7]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[6]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[5]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[4]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {bottom_out[0]}]
